tests/test_richards/richards/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     microRichardsFoam;

startFrom       latestTime;

stopAt          endTime;

endTime         30;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression no;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

runTimeModifiable no;
